Clod/RTEMS-stm32-lwip/rtems-lwip/lwip/ports/drivers/stm32h7/ethernetif.c
/**
  ******************************************************************************
  * @file    LwIP/LwIP_HTTP_Server_Netconn_RTOS/Src/ethernetif.c
  * @author  MCD Application Team
  * @brief   This file implements Ethernet network interface drivers for lwIP
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"
#include "port_conf.h"
#include "lwip/timeouts.h"
#include "netif/ethernet.h"
#include "netif/etharp.h"
#include "lwip/stats.h"
#include "lwip/snmp.h"
#include "lwip/tcpip.h"
#include "ethernetif.h"

#include "lan8742.h"
#include <string.h>

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define DMA_DESCRIPTOR_ALIGNMENT                ( 0x20 )

/* Define those to better describe your network interface. */
#define IFNAME0 's'
#define IFNAME1 't'

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* 
@Note: This interface is implemented to operate in zero-copy mode only:
        - Rx buffers are allocated statically and passed directly to the LwIP stack,
          they will return back to ETH DMA after been processed by the stack.
        - Tx Buffers will be allocated from LwIP stack memory heap, 
          then passed to ETH HAL driver.

@Notes: 
  1.a. ETH DMA Rx descriptors must be contiguous, the default count is 4, 
       to customize it please redefine ETH_RX_DESC_CNT in stm32xxxx_hal_conf.h
  1.b. ETH DMA Tx descriptors must be contiguous, the default count is 4, 
       to customize it please redefine ETH_TX_DESC_CNT in stm32xxxx_hal_conf.h

  2.a. Rx Buffers number must be between ETH_RX_DESC_CNT and 2*ETH_RX_DESC_CNT
  2.b. Rx Buffers must have the same size: ETH_RX_BUFFER_SIZE, this value must
       passed to ETH DMA in the init field (EthHandle.Init.RxBuffLen)
  2.c  The RX Ruffers addresses and sizes must be properly defined to be aligned
       to L1-CACHE line size (32 bytes).
*/

ETH_HandleTypeDef EthHandle;
ETH_TxPacketConfig TxConfig;

#ifdef __rtems__
netif_init_fn eth_lwip_init_fnc = &ethernetif_init;

/* Put into special RTEMS section and align correctly */
ETH_DMADescTypeDef DMARxDscrTab[ETH_RX_DESC_CNT] __attribute__((section(".bsp_nocache"), __aligned__(DMA_DESCRIPTOR_ALIGNMENT))); /* Ethernet Rx DMA Descriptors */
/* Put into special RTEMS section and align correctly */
ETH_DMADescTypeDef DMATxDscrTab[ETH_TX_DESC_CNT]  __attribute__((section(".bsp_nocache"), __aligned__(DMA_DESCRIPTOR_ALIGNMENT)));  /* Ethernet Tx DMA Descriptors */
/* Ethernet Receive Buffers. Just place somewhere is BSS instead of explicitely placing it */
uint8_t Rx_Buff[ETH_RX_DESC_CNT][ETH_RX_BUFFER_SIZE] RTEMS_ALIGNED(DMA_DESCRIPTOR_ALIGNMENT);
#endif /* __rtems__ */ 

lan8742_Object_t LAN8742;

#if NO_SYS == 0
sys_sem_t RxPktSemaphore; /* Semaphore to signal incoming packets */
#endif

/* Private function prototypes -----------------------------------------------*/
#if !STATIC_IP_ADDRESS && NO_SYS == 0 && LWIP_NETIF_API == 1
void set_dhcp_state(uint8_t new_state);
#endif

uint8_t determine_mpu_region_size_select(size_t lwip_heap_size);
static void low_level_init(struct netif *netif);
static err_t low_level_output(struct netif *netif, struct pbuf *p);
void ethernet_link_check_state(struct netif *netif);

void pbuf_free_custom(struct pbuf *p);

int32_t ETH_PHY_IO_Init(void);
int32_t ETH_PHY_IO_DeInit (void);
int32_t ETH_PHY_IO_ReadReg(uint32_t DevAddr, uint32_t RegAddr, uint32_t *pRegVal);
int32_t ETH_PHY_IO_WriteReg(uint32_t DevAddr, uint32_t RegAddr, uint32_t RegVal);
int32_t ETH_PHY_IO_GetTick(void);


lan8742_IOCtx_t  LAN8742_IOCtx = {ETH_PHY_IO_Init,
                               ETH_PHY_IO_DeInit,
                               ETH_PHY_IO_WriteReg,
                               ETH_PHY_IO_ReadReg,
                               ETH_PHY_IO_GetTick};

LWIP_MEMPOOL_DECLARE(RX_POOL, 10, sizeof(struct pbuf_custom), "Zero-copy RX PBUF pool");

/* Legacy HAL_ETH function wrappers for compatibility with modern HAL */
HAL_StatusTypeDef HAL_ETH_DescAssignMemory(ETH_HandleTypeDef *heth, uint32_t Index, uint8_t *pBuffer1, uint8_t *pBuffer2)
{
  /* Modern HAL doesn't have this function - use direct descriptor assignment */
  if (Index < ETH_RX_DESC_CNT) {
    heth->Init.RxDesc[Index].Desc0 = (uint32_t)pBuffer1;
    heth->Init.RxDesc[Index].Desc1 = (uint32_t)pBuffer2;
    return HAL_OK;
  }
  return HAL_ERROR;
}

uint8_t HAL_ETH_IsRxDataAvailable(ETH_HandleTypeDef *heth)
{
  /* Modern HAL uses different approach - check if data is ready */
  return (heth->RxDescList.RxDescIdx != heth->RxDescList.RxDescTailIdx) ? 1 : 0;
}

HAL_StatusTypeDef HAL_ETH_GetRxDataBuffer(ETH_HandleTypeDef *heth, ETH_BufferTypeDef *RxBuffer)
{
  /* Modern HAL equivalent - extract buffer info from descriptor */
  if (RxBuffer != NULL && heth->RxDescList.RxDescIdx < ETH_RX_DESC_CNT) {
    RxBuffer->buffer = (uint8_t *)heth->Init.RxDesc[heth->RxDescList.RxDescIdx].Desc0;
    RxBuffer->len = heth->Init.RxDesc[heth->RxDescList.RxDescIdx].Desc1 & 0x3FFF; /* Extract length */
    return HAL_OK;
  }
  return HAL_ERROR;
}

HAL_StatusTypeDef HAL_ETH_GetRxDataLength(ETH_HandleTypeDef *heth, uint32_t *Length)
{
  /* Modern HAL equivalent */
  if (Length != NULL && heth->RxDescList.RxDescIdx < ETH_RX_DESC_CNT) {
    *Length = heth->Init.RxDesc[heth->RxDescList.RxDescIdx].Desc1 & 0x3FFF; /* Extract length */
    return HAL_OK;
  }
  return HAL_ERROR;
}

HAL_StatusTypeDef HAL_ETH_BuildRxDescriptors(ETH_HandleTypeDef *heth)
{
  /* Modern HAL equivalent - advance to next descriptor */
  if (heth->RxDescList.RxDescIdx < ETH_RX_DESC_CNT) {
    heth->RxDescList.RxDescIdx++;
    if (heth->RxDescList.RxDescIdx >= ETH_RX_DESC_CNT) {
      heth->RxDescList.RxDescIdx = 0;
    }
    return HAL_OK;
  }
  return HAL_ERROR;
}

/* Private functions ---------------------------------------------------------*/
/*******************************************************************************
                       LL Driver Interface ( LwIP stack --> ETH) 
*******************************************************************************/

/**
  * @brief Should be called at the beginning of the program to set up the
  * network interface. It calls the function low_level_init() to do the
  * actual setup of the hardware.
  *
  * This function should be passed as a parameter to netif_add().
  *
  * @param netif the lwip network interface structure for this ethernetif
  * @return ERR_OK if the loopif is initialized
  *         ERR_MEM if private data couldn't be allocated
  *         any other err_t on error
  */
err_t ethernetif_init(struct netif *netif)
{
  LWIP_ASSERT("netif != NULL", (netif != NULL));

#ifdef __rtems__
#if RTEMS_LWIP_PROTECT_LWIP_HEAP_WITH_MPU == 1
  mpu_config_tx_buffers(LWIP_RAM_HEAP_POINTER, MEM_SIZE);
#endif /* RTEMS_LWIP_PROTECT_LWIP_HEAP_WITH_MPU == 1 */
#endif /* __rtems__ */

