Clod/RTEMS-stm32-lwip/rtems-lwip/lwip/ports/drivers/stm32h7/ethernetif.c
  return 0;
}

/**
  * @brief  Write a value to a PHY register through the MDIO interface.
  * @param  DevAddr: PHY port address
  * @param  RegAddr: PHY register address
  * @param  RegVal: Value to be written 
  * @retval 0 if OK -1 if Error
  */
int32_t ETH_PHY_IO_WriteReg(uint32_t DevAddr, uint32_t RegAddr, uint32_t RegVal)
{
  if(HAL_ETH_WritePHYRegister(&EthHandle, DevAddr, RegAddr, RegVal) != HAL_OK)
  {
    return -1;
  }
  
  return 0;
}

/**
  * @brief  Get the time in millisecons used for internal PHY driver process.
  * @retval Time value
  */
int32_t ETH_PHY_IO_GetTick(void)
{
  return HAL_GetTick();
}

void ethernet_link_check_state(struct netif *netif)
{
  ETH_MACConfigTypeDef MACConf;
  uint32_t PHYLinkState;
  uint32_t linkchanged = 0, speed = 0, duplex =0;

  PHYLinkState = LAN8742_GetLinkState(&LAN8742);

  if(netif_is_link_up(netif) && (PHYLinkState <= LAN8742_STATUS_LINK_DOWN))
  {
    HAL_ETH_Stop(&EthHandle);
    netif_set_down(netif);
    netif_set_link_down(netif);
  }
  else if(!netif_is_link_up(netif) && (PHYLinkState > LAN8742_STATUS_LINK_DOWN))
  {
    switch (PHYLinkState)
    {
    case LAN8742_STATUS_100MBITS_FULLDUPLEX:
      duplex = ETH_FULLDUPLEX_MODE;
      speed = ETH_SPEED_100M;
      linkchanged = 1;
      break;
    case LAN8742_STATUS_100MBITS_HALFDUPLEX:
      duplex = ETH_HALFDUPLEX_MODE;
      speed = ETH_SPEED_100M;
      linkchanged = 1;
      break;
    case LAN8742_STATUS_10MBITS_FULLDUPLEX:
      duplex = ETH_FULLDUPLEX_MODE;
      speed = ETH_SPEED_10M;
      linkchanged = 1;
      break;
    case LAN8742_STATUS_10MBITS_HALFDUPLEX:
      duplex = ETH_HALFDUPLEX_MODE;
      speed = ETH_SPEED_10M;
      linkchanged = 1;
      break;
    default:
      break;
    }

    if(linkchanged)
    {
      /* Get MAC Config MAC */
      HAL_ETH_GetMACConfig(&EthHandle, &MACConf);
      MACConf.DuplexMode = duplex;
      MACConf.Speed = speed;
      HAL_ETH_SetMACConfig(&EthHandle, &MACConf);
      HAL_ETH_Start(&EthHandle);
      netif_set_up(netif);
      netif_set_link_up(netif);
    }
  }
}

#ifdef __rtems__
#if NO_SYS == 1
/* Even for NO_SYS == 1 this needs to be implemented */
uint32_t
sys_now()
{
  /* Forward call to HAL function which already implements returning millisecond ticks */
  return HAL_GetTick();
}
#endif /* NO_SYS == 1 */

/* Configure the MPU for the lwIP heap. */
void mpu_config_tx_buffers(uint32_t base_addr, size_t region_size)
{
    MPU_Region_InitTypeDef MPU_InitStruct;
    uint8_t region_select = determine_mpu_region_size_select(region_size);

    /* Disable the MPU */
    HAL_MPU_Disable();

    /* Configure the MPU attributes as Normal Non Cacheable
       for LwIP RAM heap which contains the Tx buffers */
    MPU_InitStruct.Enable = MPU_REGION_ENABLE;
    MPU_InitStruct.BaseAddress = base_addr;
    MPU_InitStruct.Size = region_select;
    MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
    MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
    MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
    MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
    MPU_InitStruct.Number = MPU_REGION_NUMBER1;
    MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
    MPU_InitStruct.SubRegionDisable = 0x00;
    MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

    HAL_MPU_ConfigRegion(&MPU_InitStruct);

    SCB_CleanDCache_by_Addr((uint32_t*) base_addr, region_size);

    /* Enable the MPU */
    HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

}

uint8_t determine_mpu_region_size_select(size_t lwip_heap_size)
{
    if(lwip_heap_size <= 1024) {
        return MPU_REGION_SIZE_1KB;
    }
    else if(lwip_heap_size <= 2 * 1024) {
        return MPU_REGION_SIZE_2KB;
    }
    else if(lwip_heap_size <= 4 * 1024) {
        return MPU_REGION_SIZE_4KB;
    }
    else if(lwip_heap_size <= 8 * 1024) {
        return MPU_REGION_SIZE_8KB;
    }
    else if(lwip_heap_size <= 16 * 1024) {
        return MPU_REGION_SIZE_16KB;
    }
    else if(lwip_heap_size <= 32 * 1024) {
        return MPU_REGION_SIZE_32KB;
    }
    else if(lwip_heap_size <= 64 * 1024) {
        return MPU_REGION_SIZE_64KB;
    }
    else if(lwip_heap_size <= 128 * 1024) {
        return MPU_REGION_SIZE_128KB;
    }
    else if(lwip_heap_size <= 256 * 1024) {
        return MPU_REGION_SIZE_256KB;
    }
    else if(lwip_heap_size <= 512 * 1024) {
        return MPU_REGION_SIZE_512KB;
    }
    else {
        /* There is only 1MB RAM available so a MPU protection of 1MB does not really make sense */
        return MPU_REGION_SIZE_512KB;
    }
}

lan8742_Object_t* get_lan_phy_handle() {
  return &LAN8742;
}

ETH_HandleTypeDef* get_eth_handle() {
  return &EthHandle;
}
#endif /* __rtems__ */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
